# LAB 32 DATA PROCESSING

In [4]:
import numpy as np
import pandas as pd

| TransactionID | ClientID | Profession | Bank_dep | Risk | Number of credits | Revenue

In [15]:
dic_table = {}
dic_table["TransactionID"] = [1,2,3,4,5]
dic_table["ClientID"]= [231,765,453,231,892]
dic_table["Profession"]= ["Self-employed","students","Horeca","self-employed","finance"]
dic_table["Bank_dep"]= ["009","005","007","009","003"]
dic_table["Risk"]= ["High","high","medium","high","low"]
dic_table["Number of credits"]= [2,3,5,2,3]
dic_table["Revenue"]= [30200,12700,89400,30200,740000]

In [17]:
df = pd.DataFrame( dic_table )

In [18]:

df.head()

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue
0,1,231,Self-employed,009,High,2,30200
1,2,765,students,005,high,3,12700
2,3,453,Horeca,007,medium,5,89400
3,4,231,self-employed,009,high,2,30200
4,5,892,finance,003,low,3,740000

In [30]:
#Standarizing input
df["Profession"] =df["Profession"].apply(lambda x:x.lower())
df.head()

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue
0,1,231,self-employed,009,High,2,30200
1,2,765,students,005,high,3,12700
2,3,453,horeca,007,medium,5,89400
3,4,231,self-employed,009,high,2,30200
4,5,892,finance,003,low,3,740000

### Dummy Encoder

In [31]:
df_encoded = pd.get_dummies(df, "encode")
df_encoded.head()

,TransactionID,ClientID,Number of credits,Revenue,encode_finance,encode_horeca,encode_self-employed,encode_students,encode_003,encode_005,encode_007,encode_009,encode_High,encode_high,encode_low,encode_medium
0,1,231,2,30200,0,0,1,0,0,0,0,1,1,0,0,0
1,2,765,3,12700,0,0,0,1,0,1,0,0,0,1,0,0
2,3,453,5,89400,0,1,0,0,0,0,1,0,0,0,0,1
3,4,231,2,30200,0,0,1,0,0,0,0,1,0,1,0,0
4,5,892,3,740000,1,0,0,0,1,0,0,0,0,0,1,0

Create a table in the readme file that consists of the columns: Method, Library, Code, Result Encode the categorical data using the following methods using different Python libraries:

Dummy Encoder
Label Encoder
Backward Difference Coding
BaseN
Binary
CatBoost Encoder
Count Encoder
Generalized Linear Mixed Model Encoder
Hashing
Helmert Coding
James-Stein Encoder
Leave One Out
M-estimate
One Hot
Ordinal
Polynomial Coding
Sum Coding
Target Encoder
Weight of Evidence
Wrappers
Quantile Encoder
Summary Encoder

In [25]:
from sklearn import preprocessing

No ordinal data --> Profession, Bank_dep

In [32]:
le = preprocessing.LabelEncoder()

In [33]:
le.fit(df['Profession'].values)

LabelEncoder()

In [34]:
categories = list(le.classes_)
print(categories)

['finance', 'horeca', 'self-employed', 'students']

In [36]:
le.transform(df['Profession'].values)

array([2, 3, 1, 2, 0])

In [48]:
df["Profession_encode"] = le.fit_transform(df['Profession'].values)

In [49]:
df.head()

,TransactionID,ClientID,Profession,Bank_dep,Risk,Number of credits,Revenue,Profession_encode
0,1,231,self-employed,009,High,2,30200,2
1,2,765,students,005,high,3,12700,3
2,3,453,horeca,007,medium,5,89400,1
3,4,231,self-employed,009,high,2,30200,2
4,5,892,finance,003,low,3,740000,0

Ordinal variables --> Have some hierarchy : Risk and Number of cREDITS

In [45]:
ord_vals = df.loc[:,["Risk","Number of credits"]].values
#df["Number of credits"].values

In [14]:
enc = preprocessing.OrdinalEncoder()

In [47]:
enc.fit_transform(ord_vals)

array([[0., 0.],
       [1., 1.],
       [3., 2.],
       [1., 0.],
       [2., 1.]])